  62377 the
  31208 in
  27532 to
  24915 a
  22088 of
  21016 and
  16315 on
  15842 post
  14829 s
  13020 for
   9605 washington
   9254 more
   9179 badge
   9092 blogs
   8660 comments
   8260 columns
   7768 by
   7612 about
   7143 politics
   7143 is
   7070 with
   6821 are
   6637 or
   6502 at
   6230 that
   5968 as
   5482 d
   5184 c
   5012 this
   4907 world
   4831 business
   4830 badges
   4570 out
   4488 sports
   4361 national
   4202 be
   4077 you
   3952 it
   3911 request
   3893 march
   3840 going
   3748 home
   3573 opinions
   3425 find
   3410 guide
   3395 t
   3242 he
   3167 local
   3062 here
   3053 i
   2908 consistently
   2900 timely
   2870 jobs
   2811 from
   2780 house
   2760 facebook
   2756 have
   2743 all
   2734 some
   2653 save
   2652 not
   2649 our
   2634 service
   2614 was
   2570 but
   2569 entertainment
   2568 policy
   2545 area
   2531 his
   2519 thought
   2511 us
   2509 new
   2491 lifestyle
   2490 worldviews
   2479 switch
   2458 news
   2419 provoking
   2415 weather
   2407 posttv
   2382 other
   2378 said
   2375 state
   2355 how
   2343 com
   2335 posts
   2251 real
   2239 education
   2160 an
   2134 line
   2128 twitter
   2115 do
   2075 capitals
   2064 what
   2055 get
   2050 your
   2037 offer
   2032 rss
   2030 capital
   1984 top
   1981 comment
   1953 fix
   1950 has
   1942 obama
   1931 united
   1910 digital
   1894 wp
   1879 cars
   1863 back
   1848 after
   1826 health
   1824 staff
   1784 e
   1778 who
   1776 they
   1772 watch
   1761 ukraine
   1757 redskins
   1757 govbeat
   1747 know
   1722 estate
   1716 we
   1669 live
   1662 washingtonpost
   1662 sign
   1620 she
   1616 fact
   1613 va
   1603 being
   1591 things
   1588 come
   1560 up
   1558 insider
   1558 dc
   1553 big
   1544 rentals
   1531 editors
   1506 man
   1503 issa
   1495 pm
   1488 will
   1488 helena
   1475 tech
   1470 when
   1469 into
   1468 security
   1454 most
   1453 nationals
   1453 mark
   1444 must
   1439 technology
   1436 today
   1414 posted
   1413 those
   1413 story
   1409 weekend
   1406 if
   1401 people
   1399 view
   1391 club
   1389 leadership
   1374 style
   1374 et
   1373 editor
   1358 alerts
   1355 md
   1354 green
   1348 contact
   1346 day
   1344 good
   1337 plum
   1336 one
   1330 adam
   1328 white
   1326 these
   1321 team
   1320 county
   1318 ad
   1313 virginia
   1307 advertising
   1296 subscribe
   1296 pizza
   1287 russia
   1279 magazine
   1276 well
   1275 obituaries
   1272 law
   1271 reader
   1270 page
   1270 express
   1268 could
   1267 ramanathan
   1267 lavanya
   1264 discussion
   1261 taylor
   1255 innovations
   1254 terms
   1244 why
   1244 newspaper
   1242 wine
   1218 federal
   1216 brandconnect
   1209 full
   1205 maryland
   1202 subscription
   1197 friday
   1194 blog
   1193 appear
   1189 international
   1187 states
   1173 right
   1152 congress
   1149 free
   1147 read
   1139 their
   1137 tv
   1136 would
   1131 crimea
   1124 users
   1123 three
   1118 movies
   1118 can
   1116 u
   1105 care
   1104 first
   1095 true
   1095 campaign
   1092 events
   1074 gun
   1071 paper
   1069 photos
   1053 writers
   1050 play
   1048 early
   1042 job
   1039 culture
   1037 cummings
   1018 particularly
   1016 game
   1015 email
   1013 women
   1009 there
   1009 likely
   1005 short
   1003 list
   1003 forum
   1001 affairs
    991 checker
    988 had
    987 fed
    980 useful
    980 contributor
    979 commenter
    978 relevant
    977 michael
    975 logged
    975 contributors
    974 been
    973 recommend
    972 carolyn
    971 watcher
    971 hax
    968 replies
    968 displayed
    967 watchers
    967 paused
    966 superfan
    957 raise
    957 hearing
    953 source
    949 over
    946 crimean
    938 m
    933 possible
    928 music
    927 minimum
    927 may
    923 polling
    922 apologizes
    921 war
    916 wage
    916 smart
    916 got
    914 courts
    913 est
    913 aaron
    911 http
    905 off
    904 no
    904 archive
    903 repairs
    901 outcome
    900 blake
    899 year
    897 joe
    896 eye
    896 end
    894 independence
    893 return
    892 reprints
    892 help
    890 its
    889 reid
    887 wizards
    887 reliable
    885 wilson
    880 transcript
    880 monkey
    878 cage
    876 annexation
    874 yakovlev
    874 nadiya
    874 kravets
    874 golani
    873 walter
    870 economy
    869 chris
    868 two
    868 hawaii
    863 turning
    859 raucous
    858 ways
    858 support
    857 ed
    855 showtimes
    852 share
    846 rain
    843 were
    843 students
    843 now
    843 christie
    837 davidson
    836 store
    834 lion
    830 time
    830 iciness
    829 am
    828 place
    823 which
    822 report
    821 food
    818 matt
    817 money
    815 parents
    813 waterfront
    812 nfl
    808 questions
    806 so
    806 movie
    805 control
    803 dr
    802 deal
    798 cartoons
    796 turn
    796 nation
    793 games
    793 agent
    791 fight
    787 york
    787 photo
    787 categories
    785 privacy
    783 toles
    783 class
    782 writer
    781 target
    781 bitcoin
    780 advice
    776 than
    776 important
    771 theater
    768 wpost
    767 books
    766 wpostserver
    766 css
    764 crime
    762 nats
    762 like
    761 upper
    759 small
    759 dan
    758 any
    757 person
    756 science
    754 travel
    752 letters
    750 single
    750 featured
    749 community
    748 telnaes
    748 capitol
    747 stories
    747 animations
    746 jennifer
    744 mobile
    743 soccer
    739 my
    737 greg
    736 cut
    733 traditional
    731 columnist
    730 transportation
    730 middle
    726 cpac
    725 match
    724 her
    724 details
    722 safeties
    721 places
    721 nba
    721 archives
    720 reddit
    719 dance
    717 see
    717 delicious
    716 energy
    715 syrian
    715 stumbleupon
    715 rubin
    715 ready
    715 digg
    713 topics
    713 president
    713 discussions
    712 nhl
    712 james
    711 obamacare
    710 buy
    709 saved
    709 east
    708 school
    708 museums
    706 nominees
    705 classifieds
    704 journal
    703 comics
    702 gridlock
    701 oscars
    701 michelle
    701 just
    701 edt
    699 representative
    698 rubio
    698 midwest
    697 index
    697 charts
    697 awards
    696 members
    695 garden
    694 supermarket
    692 brady
    690 approach
    688 years
    688 sarah
    688 relief
    687 sargent
    686 struck
    684 postpartisan
    684 him
    684 denies
    683 petri
    683 markets
    681 paid
    681 charged
    680 gang
    680 also
    679 alexandra
    678 search
    678 bullish
    677 marco
    677 giving
    676 fell
    675 tracking
    675 comic
    674 trains
    674 bog
    672 emily
    671 write
    670 compost
    668 sues
    666 next
    666 cecilia
    665 survivor
    665 color
    664 pope
    664 francis
    662 religion
    662 kang
    662 cities
    662 brian
    661 shots
    661 katie
    660 mail
    659 go
    658 ll
    658 europe
    657 spider
    657 singletary
    657 arts
    656 competitors
    655 wagner
    654 superman
    654 information
    654 carrera
    653 searching
    651 refugee
    651 batkid
    651 africa
    650 monocles
    650 master
    650 industries
    650 grabs
    648 rogers
    648 india
    647 steinberg
    647 riffs
    647 leukemia
    646 number
    646 graffiato
    645 re
    645 life
    645 jarring
    645 image
    644 punt
    644 galleries
    644 environment
    644 allmetsports
    643 mcgregor
    643 colleges
    642 innovation
    641 troll
    640 henderson
    639 jena
    638 experts
    638 danny
    637 mlb
    636 strange
    636 investigations
    636 deals
    636 bullock
    636 asia
    635 regulation
    634 wonkblog
    634 cheapest
    634 airships
    633 careers
    632 parenting
    632 newsletter
    632 ian
    632 espinosa
    632 briefly
    631 relaxed
    631 livingston
    630 victoria
    630 ross
    630 pacific
    630 ftc
    630 benning
    629 tsukayama
    629 hayley
    629 berman
    628 teen
    628 kidspost
    628 el
    628 cavna
    627 lynn
    627 cricket
    627 american
    626 fung
    626 corrections
    626 conspiracy
    626 choices
    625 mtv
    624 yang
    624 fashion
    623 sedition
    623 rip
    623 partners
    623 info
    623 don
    622 weddings
    622 natalie
    622 jennings
    622 andrews
    621 jia
    620 yahr
    620 volokh
    620 poll
    620 analyzing
    619 mcfarland
    619 jackie
    619 feed
    618 wellness
    618 rama
    618 nia
    618 malika
    618 lakshmi
    618 kucinich
    618 guidelines
    617 settles
    617 puzzles
    617 americas
    616 exits
    616 endorsements
    616 delivery
    616 apps
    615 others
    615 horoscopes
    615 disclosing
    615 adt
    614 tran
    614 spams
    614 somin
    614 ohlendorf
    614 ilya
    614 gift
    613 syndicate
    612 parade
    611 latino
    611 alley
    608 press
    604 publishing
    603 topic
    603 replica
    602 tiempo
    601 submissions
    601 postpoints
    601 permissions
    596 them
    586 government
    582 newsletters
    582 company
    567 false
    565 reporters
    564 saying
    560 teams
    560 need
    560 metro
    558 best
    553 add
    551 cases
    550 make
    550 aren
    546 address
    545 updates
    544 where
    544 through
    544 permalink
    539 should
    539 facts
    539 associated
    537 click
    532 paul
    530 articles
    529 putin
    529 additional
    528 link
    527 want
    525 many
    523 police
    522 sources
    522 reporter
    522 producer
    522 close
    520 quoted
    519 offensive
    515 last
    511 before
    508 communities
    502 sat
    501 forecasts
    500 trends
    500 even
    500 automatic
    499 contribute
    496 country
    494 pause
    493 says
    492 washingtologist
    492 recommended
    491 disagree
    490 pubdate
    490 bill
    489 initialcomments
    489 former
    489 displaycomments
    489 currentdate
    489 commentperiod
    489 commentenddate
    489 allowcomments
    488 ryan
    488 restart
    488 holders
    485 tab
    485 spam
    485 notified
    485 checkers
    484 think
    484 opens
    484 me
    483 washingtologists
    483 try
    483 connoisseurs
    483 connoisseur
    483 climates
    483 badgesget
    477 only
    476 say
    475 george
    474 senate
    473 posting
    473 loading
    470 because
    469 vote
    466 prince
    461 still
    458 schools
    458 article
    447 days
    446 show
    445 down
    440 st
    440 percent
    439 take
    424 recent
    423 test
    423 sen
    421 send
    415 won
    413 made
    412 might
    412 did
    412 comes
    409 much
    409 follow
    402 against
    398 too
    398 then
    398 romney
    396 week
    395 shows
    393 city
    393 center
    390 videos
    390 silver
    389 while
    389 way
    388 children
    387 darrell
    386 html
    386 haiti
    384 involved
    383 popular
    376 season
    376 john
    374 gillibrand
    371 work
    370 alexandria
    368 ago
    367 dishes
    366 gog
    365 past
    365 mcdonnell
    364 between
    361 really
    358 satoshi
    358 nakamoto
    356 tags
    354 backlash
    353 video
    352 latest
    351 high
    350 military
    349 political
    346 officials
    345 public
    345 around
    342 furious
    341 safeway
    340 scores
    338 become
    336 calif
    335 republicans
    335 family
    333 region
    333 long
    333 agency
    332 keystone
    332 group
    332 board
    331 maureen
    330 ve
    329 general
    329 americans
    328 media
    325 committee
    322 since
    319 use
    318 very
    318 related
    318 create
    317 review
    317 crisis
    316 kids
    314 friend
    313 part
    311 map
    310 such
    310 little
    309 university
    309 among
    306 date
    305 based
    303 coming
    301 another
    298 second
    296 unconstitutional
    296 million
    296 fairfax
    294 gop
    294 detail
    292 during
    291 making
    290 look
    289 personal
    289 needs
    288 earthquake
    287 history
    287 death
    287 college
    285 immigration
    285 four
    284 book
    280 results
    280 black
    279 lining
    278 great
    278 both
    277 account
    276 fan
    276 anne
    274 derails
    272 select
    272 own
    272 night
    271 join
    271 every
    270 p
    268 weekly
    267 across
    265 opened
    264 thurs
    264 south
    264 peter
    264 open
    263 according
    262 took
    261 strauss
    261 f
    260 william
    260 morning
    260 including
    259 th
    259 standings
    259 old
    257 democrats
    256 valerie
    255 let
    255 five
    254 park
    253 love
    250 district
    250 america
    248 gallery
    246 called
    244 sun
    244 better
    243 schedule
    243 men
    241 move
    241 left
    241 does
    241 baltimore
    240 r
    239 office
    239 david
    238 wants
    238 teachers
    238 submit
    238 defense
    238 behind
    237 system
    237 few
    236 station
    236 foreign
    235 never
    235 monthly
    234 party
    234 half
    233 start
    233 less
    233 found
    233 didn
    232 running
    232 o
    232 log
    231 outside
    230 sex
    230 lady
    229 used
    229 told
    229 put
    229 makes
    228 under
    228 far
    227 fri
    227 category
    225 point
    222 thompson
    221 times
    221 tax
    221 street
    221 same
    221 hit
    220 isn
    220 content
    219 major
    219 looking
    219 delivered
    218 lot
    216 something
    216 set
    216 election
    216 arlington
    215 montgomery
    215 highlight
    215 administration
    214 wed
    214 mon
    213 mails
    213 least
    212 tuesday
    212 tues
    212 assault
    208 mike
    208 directly
    206 issues
    206 erratic
    206 data
    205 pay
    205 month
    205 future
    205 executive
    204 whether
    204 statistics
    204 insecure
    203 portray
    202 rights
    199 final
    199 each
    197 sexual
    196 talk
    196 power
    195 thomas
    195 keeps
    195 current
    195 court
    195 again
    194 traffic
    194 later
    194 j
    194 inbox
    194 chief
    193 republican
    193 entries
    192 win
    192 king
    192 especially
    192 budget
    191 score
    190 gets
    189 online
    189 johnson
    189 hard
    188 killed
    188 career
    187 presidential
    187 doesn
    187 connected
    187 amy
    186 question
    185 without
    185 site
    185 section
    185 leaders
    185 lead
    184 water
    184 reviews
    184 plan
    184 economic
    184 director
    184 daily
    183 thursday
    183 son
    183 round
    183 near
    183 financial
    182 though
    182 n
    182 ends
    182 charles
    180 slayings
    180 chat
    179 wednesday
    179 spending
    179 coverage
    178 speech
    178 loudoun
    177 department
    177 ask
    176 theatre
    175 tumblr
    174 woman
    174 train
    173 young
    173 several
    173 mother
    173 low
    173 case
    172 vs
    172 nbc
    172 mr
    172 months
    172 learn
    172 homepage
    172 cranston
    171 problem
    171 key
    171 keep
    171 editorial
    171 bryan
    170 special
    170 response
    170 problems
    170 bets
    170 act
    169 west
    169 opening
    168 someone
    168 private
    168 market
    168 b
    168 art
    168 air
    167 trial
    167 sanctions
    167 hits
    167 china
    167 change
    167 anywhere
    166 miss
    166 manager
    166 howard
    166 appall
    165 jan
    165 enough
    164 winning
    164 wife
    164 research
    164 favorite
    164 effect
    163 record
    163 prison
    163 non
    163 location
    163 erik
    162 ap
    161 wemple
    161 spring
    161 once
    161 leave
    161 asked
    160 x
    160 race
    160 face
    159 student
    159 nw
    159 name
    159 al
    158 texas
    158 road
    158 nick
    158 museum
    158 civil
    157 unlikely
    157 services
    157 senior
    157 robert
    157 often
    157 gray
    156 third
    156 program
    156 meeting
    156 away
    155 voters
    155 via
    155 six
    155 believe
    154 project
    154 clear
    154 check
    153 union
    153 thewashingtonpost
    153 taking
    153 hank
    153 done
    153 already
    152 stay
    152 soon
    152 restaurants
    152 debate
    152 common
    152 car
    152 always
    151 until
    151 drug
    151 conservative
    150 run
    150 lawmakers
    149 roster
    149 musical
    149 ice
    149 app
    148 trying
    148 stuever
    148 stand
    148 series
    148 hill
    148 getting
    148 bowl
    148 bad
    147 stores
    147 ernie
    147 church
    147 ben
    146 wrote
    146 talks
    146 recently
    146 network
    146 loop
    146 grunfeld
    146 feeds
    145 slavery
    145 plans
    145 letter
    145 ever
    145 abc
    144 weakness
    144 side
    144 looks
    144 iraq
    144 came
    143 drive
    142 yet
    142 web
    142 wall
    142 views
    142 frederick
    141 population
    141 l
    141 advocates
    140 met
    140 gay
    140 friends
    139 study
    139 signs
    139 points
    139 event
    139 error
    138 wages
    138 takes
    138 monday
    138 lil
    138 candidates
    138 ahead
    137 shot
    137 give
    137 caucus
    137 actually
    136 term
    136 reading
    135 goingoutguide
    135 answer
    134 voice
    134 performing
    134 loss
    134 call
    134 bars
    133 user
    133 steenkamp
    133 players
    133 images
    133 head
    133 council
    132 went
    132 thing
    132 rapper
    132 mix
    132 losing
    132 issue
    132 forces
    131 syria
    131 sunday
    131 libya
    131 krauthammer
    131 fox
    131 arundel
    131 action
    130 tom
    130 thread
    130 sales
    130 programs
    130 locations
    130 expect
    130 connect
    130 boehner
    130 along
    129 talking
    129 please
    129 led
    129 girl
    128 drivers
    128 different
    128 basketball
    128 appearance
    127 yes
    127 teacher
    127 limited
    127 kennedy
    127 iphone
    127 front
    127 field
    126 title
    126 piece
    126 nearly
    126 meet
    126 congressional
    126 companies
    126 boosie
    125 waiting
    125 town
    125 slave
    125 ruled
    125 readers
    125 pitch
    125 oversight
    125 north
    125 himself
    125 groups
    125 gives
    125 debt
    125 central
    124 username
    124 tell
    124 pistorius
    124 northwest
    124 everything
    124 democratic
    124 argument
    123 wrong
    123 seen
    123 le
    123 kissinger
    123 hours
    123 army
    122 partisan
    122 getty
    122 forward
    122 doing
    122 began
    121 working
    121 southern
    121 medicaid
    121 kind
    121 dead
    121 billion
    121 actions
    120 prices
    120 performance
    120 known
    120 industry
    120 hand
    120 answers
    119 skating
    119 sale
    119 practices
    119 dana
    119 blogstory
    119 anything
    119 anderson
    119 age
    118 social
    118 protect
    118 late
    118 decision
    118 british
    118 breaking
    117 reversal
    117 red
    117 profile
    117 probably
    117 laura
    117 kill
    117 interviews
    117 almost
    116 official
    116 nothing
    116 continue
    116 cannot
    115 whose
    115 mason
    115 japan
    115 god
    115 garry
    115 experience
    115 broadway
    114 werth
    114 trevor
    114 seek
    114 parent
    114 note
    114 member
    114 lo
    114 leader
    114 development
    114 calls
    113 winogrand
    113 management
    113 jr
    113 fill
    113 core
    113 coach
    113 clash
    113 attack
    112 weeks
    112 rep
    112 release
    112 referendum
    112 pick
    112 lost
    112 level
    112 iii
    112 having
    112 candidate
    112 california
    111 transit
    111 saturday
    111 released
    111 ramanewdelhi
    111 inside
    111 governor
    111 feel
    111 divide
    111 de
    111 circle
    110 unspecified
    110 theaters
    110 taken
    110 reported
    110 needed
    110 keefe
    110 jones
    110 fall
    110 effort
    110 correspondents
    109 missed
    109 hispanics
    109 happy
    109 features
    109 fang
    109 essential
    109 dinner
    109 building
    108 workers
    108 wintry
    108 vozzella
    108 rise
    108 professor
    108 numbers
    108 manners
    108 countries
    107 stripped
    107 resurrection
    107 martin
    107 families
    107 expected
    107 booker
    106 neymar
    106 invader
    106 hurting
    106 earlier
    105 within
    105 summer
    105 robinson
    105 mi
    105 diplomate
    105 arrested
    104 worked
    104 w
    104 update
    104 tough
    104 super
    104 stands
    104 spat
    104 role
    104 remains
    104 reform
    104 large
    104 bruins
    103 wanted
    103 text
    103 sure
    103 statement
    103 russian
    103 modern
    103 minutes
    103 interview
    103 hour
    103 further
    102 woods
    102 seven
    102 football
    102 following
    102 despite
    102 deadspin
    102 daughter
    102 cuts
    101 writes
    101 turned
    101 tragedy
    101 together
    101 richard
    101 reforms
    101 perry
    101 memorial
    101 kirsten
    101 ideas
    101 however
    101 fire
    101 faces
    101 cereals
    101 applications
    101 able
    100 tried
    100 rules
    100 insurance
    100 injuries
    100 greater
    100 given
    100 exchange
    100 employees
    100 conference
    100 although
     99 started
     99 reflect
     99 recorded
     99 mitt
     99 marks
     99 idea
     99 held
     99 funding
     99 course
     99 anymore
     98 scientific
     98 prize
     98 playing
     98 picks
     98 journey
     98 invaded
     98 income
     98 includes
     98 hermann
     98 father
     98 everyone
     98 clinton
     97 struggle
     97 star
     97 resources
     97 player
     97 orders
     97 op
     97 impose
     97 google
     97 gold
     97 drop
     97 columbia
     96 trending
     96 rates
     96 primary
     96 invasion
     96 hope
     96 co
     95 using
     95 ticket
     95 stage
     95 room
     95 process
     95 missing
     95 increase
     95 guys
     95 guns
     95 gas
     95 dolby
     95 ceo
     95 announced
     94 testing
     94 terps
     94 motion
     94 cosby
     94 chairmanship
     94 assumed
     94 adopt
     93 triumph
     93 trade
     93 price
     93 parker
     93 kid
     93 jack
     93 evidence
     93 complete
     93 chili
     93 child
     93 changes
     93 ann
     93 admission
     92 valid
     92 stop
     92 smoke
     92 secretary
     92 residents
     92 purchase
     92 falls
     92 else
     92 dating
     92 couple
     92 chance
     92 african
     91 sometimes
     91 postopinions
     91 ncaa
     91 mary
     91 justice
     91 goal
     91 conversation
     91 activists
     90 wise
     90 swing
     90 human
     90 hospital
     90 hall
     90 elections
     89 seems
     89 rate
     89 played
     89 include
     89 ex
     89 efforts
     89 died
     89 crimes
     89 competition
     89 attention
     88 works
     88 toward
     88 strong
     88 sites
     88 sets
     88 rick
     88 plus
     88 marriage
     88 leads
     88 hunger
     88 griffin
     88 focus
     88 eight
     88 drinks
     88 added
     87 wasn
     87 stats
     87 restaurant
     87 potential
     87 parts
     87 lists
     87 legal
     87 global
     87 force
     87 brown
     87 became
     87 aid
     86 v
     86 stephen
     86 sheet
     86 sent
     86 message
     86 lane
     86 israel
     86 easy
     86 critical
     85 wouldn
     85 victory
     85 table
     85 strategy
     85 statistically
     85 safety
     85 range
     85 mayor
     85 internet
     85 gifts
     85 georgetown
     85 created
     85 conservatives
     85 comedy
     85 bring
     85 bit
     85 approved
     84 yourself
     84 ruissa
     84 means
     84 matter
     84 lincoln
     84 jeff
     84 firm
     84 disclaimerthis
     83 williams
     83 upcoming
     83 themselves
     83 senators
     83 resume
     83 mexico
     83 league
     83 joining
     83 jeffrey
     83 hears
     83 gadhafi
     83 familiar
     83 criticism
     83 clubs
     83 catch
     83 auto
     83 activity
     82 www
     82 previous
     82 poor
     82 goes
     82 english
     81 scott
     81 reason
     81 reagan
     81 order
     81 kunkle
     81 interest
     81 fredrick
     81 cover
     81 author
     81 association
     81 advanced
     80 worth
     80 truck
     80 stars
     80 singer
     80 similar
     80 senator
     80 rt
     80 print
     80 offers
     80 jonathan
     80 henry
     80 gov
     80 eats
     80 delievery
     80 april
     80 apple
     79 vice
     79 type
     79 thinking
     79 taxes
     79 quarter
     79 northern
     79 miscellaneous
     79 living
     79 hot
     79 ga
     79 chase
     79 carolina
     79 balz
     79 assistant
     79 ambassador
     78 words
     78 trump
     78 square
     78 perhaps
     78 heard
     78 dies
     78 cup
     78 clinics
     78 box
     77 thank
     77 sell
     77 nomination
     77 lives
     77 links
     77 hands
     77 growing
     77 girlfriend
     77 fans
     77 changing
     77 break
     77 access
     76 zapotosky
     76 worse
     76 scene
     76 revenue
     76 rather
     76 prescription
     76 passed
     76 opera
     76 offense
     76 nri
     76 notes
     76 lorde
     76 london
     76 learning
     76 homes
     76 fun
     76 finds
     76 bethesda
     76 abortion
     75 whatsapp
     75 violates
     75 vikings
     75 urban
     75 total
     75 sleep
     75 perpetual
     75 named
     75 instead
     75 flexibility
     75 european
     75 eugene
     75 closed
     75 brandon
     75 bieber
     75 asleep
     74 wins
     74 tiger
     74 santorum
     74 rented
     74 provide
     74 prosecutor
     74 port
     74 panel
     74 moment
     74 mind
     74 keywords
     74 hold
     74 higher
     74 graham
     74 finance
     74 figure
     74 facing
     74 crowd
     74 base
     74 ashley
     74 analyst
     73 reviewed
     73 register
     73 practice
     73 opinion
     73 movement
     73 legislation
     73 karen
     73 january
     73 friendly
     73 dvorak
     73 critics
     73 cost
     73 chevy
     73 chairman
     73 becoming
     73 band
     72 position
     72 petula
     72 maybe
     72 intelligence
     72 gave
     72 extradited
     72 bottomless
     71 turns
     71 storm
     71 steve
     71 rule
     71 q
     71 pretty
     71 jayson
     71 hopkins
     71 heroin
     71 decry
     71 challenge
     71 caps
     71 amid
     71 airlines
     71 aggressive
     70 step
     70 spent
     70 shouldn
     70 sense
     70 phil
     70 moved
     70 miller
     70 main
     70 individual
     70 gearan
     70 evening
     70 cia
     70 bush
     70 build
     70 beware
     70 barn
     70 attorney
     70 analysis
     70 allen
     69 winter
     69 wide
     69 weapons
     69 systems
     69 slaves
     69 shadow
     69 rosslyn
     69 reuters
     69 phone
     69 nations
     69 mortgage
     69 july
     69 halsey
     69 fiscal
     69 essay
     69 enter
     69 closure
     69 boys
     69 alexander
     69 afternoon
     68 y
     68 version
     68 tseng
     68 tim
     68 stuff
     68 requirement
     68 prompts
     68 per
     68 patriot
     68 organization
     68 olympic
     68 lose
     68 longer
     68 justin
     68 holiday
     68 helped
     68 hedgpeth
     68 foundation
     68 emy
     68 difficult
     68 delegates
     68 crackdown
     68 buzz
     68 blame
     68 anti
     68 anchor
     68 allegation
     68 airport
     68 agenda
     67 wt
     67 visit
     67 trove
     67 success
     67 subsection
     67 sitting
     67 signature
     67 sample
     67 reports
     67 mass
     67 leaving
     67 leading
     67 laws
     67 judge
     67 ishome
     67 harper
     67 documents
     67 diaries
     67 deep
     67 continues
     67 award
     67 approval
     67 anyone
     66 viewing
     66 tow
     66 tells
     66 staples
     66 singapore
     66 simondenyer
     66 secret
     66 rich
     66 max
     66 matthew
     66 language
     66 happened
     66 ground
     66 fourth
     66 either
     66 column
     66 collection
     66 bar
     65 votes
     65 veteran
     65 track
     65 thousands
     65 tall
     65 spokesman
     65 simply
     65 shutdown
     65 serious
     65 sculpture
     65 rest
     65 opposition
     65 mls
     65 louisiana
     65 lee
     65 hokies
     65 heights
     65 finally
     65 everybody
     65 continued
     65 century
     65 bringer
     65 advisory
     65 academy
     65 aap
     64 straight
     64 song
     64 shooting
     64 self
     64 schedules
     64 quickly
     64 production
     64 medical
     64 lanes
     64 guy
     64 frank
     64 example
     64 draws
     64 decided
     64 computer
     64 cavaliers
     64 brain
     64 beyond
     63 western
     63 wesley
     63 trailer
     63 teaching
     63 steven
     63 sought
     63 seat
     63 receive
     63 plea
     63 pass
     63 neighborhood
     63 impact
     63 groping
     63 elizabeth
     63 contract
     63 childhood
     63 catholic
     63 baby
     62 training
     62 theme
     62 status
     62 society
     62 significant
     62 rejects
     62 pressure
     62 poverty
     62 medal
     62 knew
     62 k
     62 institute
     62 holes
     62 growth
     62 gone
     62 florida
     62 discuss
     62 davis
     62 concerns
     62 chinese
     62 cash
     62 brought
     62 biggest
     62 authority
     61 whole
     61 understand
     61 redesign
     61 prime
     61 nsa
     61 mean
     61 iran
     61 hiv
     61 fit
     61 engineer
     61 detective
     61 craig
     61 contributed
     61 confirms
     61 blinded
     61 beltway
     61 avoid
     60 taste
     60 sort
     60 smith
     60 seem
     60 runs
     60 rink
     60 remain
     60 proposal
     60 period
     60 lowery
     60 la
     60 june
     60 hiring
     60 highways
     60 heart
     60 female
     60 dupont
     60 decisions
     60 colleagues
     60 charge
     60 certainly
     60 boiling
     60 baseball
     59 television
     59 situation
     59 scheduled
     59 risk
     59 require
     59 recycling
     59 oppose
     59 nova
     59 moving
     59 model
     59 looked
     59 land
     59 knows
     59 floor
     59 film
     59 era
     59 decade
     59 corporate
     59 battle
     59 appeared
     59 angeles
     59 agreement
     58 violence
     58 veterans
     58 tea
     58 soldiers
     58 rock
     58 nine
     58 musicians
     58 minister
     58 los
     58 light
     58 kevin
     58 harlem
     58 haitian
     58 grade
     58 globetrotters
     58 franklin
     58 faith
     58 commission
     58 cnn
     58 closing
     58 bottom
     58 boston
     58 bk
     57 truth
     57 result
     57 rd
     57 planning
     57 lines
     57 labor
     57 jay
     57 ignatius
     57 holds
     57 hey
     57 hate
     57 happen
     57 fred
     57 fbi
     57 eddie
     57 appears
     57 apology
     56 wheels
     56 space
     56 quite
     56 plays
     56 perfect
     56 patrick
     56 parties
     56 majority
     56 learned
     56 klein
     56 jon
     56 investigation
     56 hopes
     56 harry
     56 freedom
     56 france
     56 chicago
     56 characters
     56 bryce
     56 braves
     56 biden
     56 ball
     55 winners
     55 usually
     55 silences
     55 seemed
     55 scientists
     55 relationship
     55 provided
     55 picture
     55 metropolitan
     55 limit
     55 largest
     55 larger
     55 inc
     55 hook
     55 gingrich
     55 ford
     55 festival
     55 failed
     55 driving
     55 door
     55 disease
     55 decades
     55 convention
     55 considered
     55 claim
     55 avenue
     55 alone
     55 allowed
     54 watching
     54 victims
     54 supreme
     54 standardized
     54 speed
     54 saw
     54 retail
     54 rescue
     54 regime
     54 rachel
     54 polls
     54 pentagon
     54 mission
     54 mccain
     54 massive
     54 levels
     54 lbj
     54 katherine
     54 itself
     54 grand
     54 excited
     54 draw
     54 deficit
     54 chambers
     54 blue
     54 bank
     54 audience
     54 asian
     54 arrest
     54 above
     54 ability
     53 wonkbook
     53 spot
     53 signing
     53 property
     53 opportunity
     53 measure
     53 kept
     53 journalist
     53 independent
     53 husband
     53 holding
     53 form
     53 famous
     53 ezra
     53 extra
     53 critic
     53 claims
     53 chicoharlan
     53 campus
     53 cairo
     53 border
     53 agencies
     52 value
     52 throughout
     52 starting
     52 southeast
     52 roberts
     52 outlook
     52 org
     52 officer
     52 mostly
     52 minute
     52 mall
     52 killing
     52 jim
     52 interrogation
     52 haven
     52 feb
     52 exclusive
     52 cool
     52 consider
     52 carol
     52 born
     52 blink
     52 barack
     52 au
     52 assad
     51 twice
     51 steps
     51 standards
     51 shares
     51 regular
     51 oil
     51 mcconnell
     51 lineups
     51 laris
     51 finished
     51 feet
     51 drugs
     51 dream
     51 declined
     51 choose
     51 certain
     51 canada
     51 allow
     51 allies
     51 agents
     50 worst
     50 tweets
     50 trouble
     50 tour
     50 surgeon
     50 split
     50 spirit
     50 sold
     50 slow
     50 repeal
     50 reacts
     50 puts
     50 policies
     50 peace
     50 natural
     50 nakamura
     50 loan
     50 jerry
     50 jazz
     50 hundreds
     50 hp
     50 goff
     50 generation
     50 fail
     50 employer
     50 downtown
     50 december
     50 considering
     50 cold
     50 bureau
     50 boswell
     50 begins
     50 beat
     50 attacks
     50 allegations
     49 zimmerman
     49 yards
     49 word
     49 weiner
     49 websites
     49 stem
     49 session
     49 sandy
     49 root
     49 ride
     49 reeva
     49 quantum
     49 protest
     49 plenty
     49 northeast
     49 ms
     49 lower
     49 knowledge
     49 inflation
     49 illegal
     49 h
     49 goals
     49 givens
     49 eat
     49 dynamics
     49 creator
     49 couldn
     49 costs
     49 contest
     49 candidacy
     49 berlin
     49 beijing
     49 barry
     49 andre
     49 anacostia
     48 younger
     48 yesterday
     48 written
     48 weigh
     48 thanks
     48 sport
     48 spoke
     48 sea
     48 records
     48 raising
     48 push
     48 pakistan
     48 oscar
     48 ones
     48 nominations
     48 nato
     48 moscow
     48 methods
     48 liberals
     48 lack
     48 jordan
     48 investment
     48 immigrants
     48 immediately
     48 imax
     48 hotels
     48 golf
     48 funds
     48 february
     48 fast
     48 eastern
     48 dickinson
     48 customers
     48 changed
     48 body
     48 beginning
     48 beaches
     48 authorities
     48 achievement
     47 van
     47 trust
     47 tournament
     47 tests
     47 tensions
     47 supporters
     47 successful
     47 sound
     47 skills
     47 signed
     47 shoelaces
     47 received
     47 protesters
     47 pro
     47 preview
     47 parking
     47 opportunities
     47 milbank
     47 loves
     47 kamen
     47 headlines
     47 guest
     47 graphic
     47 g
     47 fund
     47 fraud
     47 finding
     47 farhi
     47 dozen
     47 deyoung
     47 commercial
     47 clean
     47 charges
     47 cast
     47 calling
     47 block
     47 begin
     47 ban
     47 average
     47 ave
     47 annual
     47 annapolis
     47 animal
     47 aids
     46 yard
     46 writing
     46 undermined
     46 truly
     46 tradition
     46 surprise
     46 speaker
     46 settings
     46 serve
     46 sections
     46 returns
     46 proposed
     46 produce
     46 prepares
     46 november
     46 nobody
     46 newseum
     46 millions
     46 matches
     46 laden
     46 jungle
     46 jail
     46 included
     46 hear
     46 felt
     46 fantasy
     46 fair
     46 experienced
     46 exist
     46 etc
     46 dining
     46 ct
     46 csc
     46 credit
     46 chuck
     46 chemical
     46 cheap
     46 channel
     46 challenges
     46 caught
     46 brother
     46 bills
     46 attempt
     46 acrimony
     46 absolutely
     45 wapo
     45 treatment
     45 surveys
     45 socks
     45 sit
     45 responsible
     45 remember
     45 reach
     45 ravitch
     45 powers
     45 older
     45 noted
     45 names
     45 morgan
     45 modi
     45 mental
     45 medicare
     45 marimow
     45 mar
     45 liberal
     45 lewis
     45 kejriwal
     45 guardian
     45 guard
     45 gerson
     45 fine
     45 dyn
     45 double
     45 detroit
     45 count
     45 complicated
     45 classic
     45 businesses
     45 bin
     45 benefits
     45 benefit
     45 agreed
     44 wing
     44 uninsured
     44 trip
     44 tony
     44 spend
     44 speak
     44 solyndra
     44 salon
     44 opener
     44 nov
     44 marketplaces
     44 longtime
     44 logan
     44 lean
     44 investors
     44 increasingly
     44 improve
     44 host
     44 fees
     44 edge
     44 dollars
     44 defensive
     44 criticisms
     44 closer
     44 cleveland
     44 calvert
     44 available
     44 applebaum
     44 accountant
     43 voted
     43 troops
     43 transition
     43 susan
     43 size
     43 sides
     43 ron
     43 reality
     43 positions
     43 patients
     43 palin
     43 novel
     43 lisa
     43 jason
     43 items
     43 increased
     43 huge
     43 holidays
     43 hamilton
     43 grew
     43 girls
     43 frozen
     43 enforcement
     43 elected
     43 due
     43 draft
     43 dollar
     43 dionne
     43 designed
     43 brings
     43 breaks
     43 bipartisan
     43 beethoven
     43 banks
     43 areas
     42 whom
     42 wang
     42 walking
     42 takoma
     42 surprising
     42 studies
     42 stewart
     42 showed
     42 secretly
     42 ruling
     42 rose
     42 resistant
     42 recovery
     42 philip
     42 options
     42 ohio
     42 oct
     42 menendez
     42 margaret
     42 lawyer
     42 jerusalem
     42 healthcare
     42 happening
     42 handles
     42 gene
     42 gaddafi
     42 eric
     42 educated
     42 dirda
     42 code
     42 championship
     42 bus
     42 background
     42 aug
     41 welcome
     41 warns
     41 telling
     41 supper
     41 sprint
     41 showing
     41 served
     41 sees
     41 seconds
     41 salt
     41 rising
     41 revamp
     41 responsibility
     41 resigns
     41 required
     41 quote
     41 putting
     41 overload
     41 oh
     41 occupy
     41 oates
     41 nra
     41 noon
     41 nepal
     41 moves
     41 mia
     41 meant
     41 markon
     41 manassas
     41 literacy
     41 largely
     41 kaplan
     41 injured
     41 hitler
     41 historic
     41 fresh
     41 founder
     41 fiction
     41 fairs
     41 exhibits
     41 exactly
     41 ethics
     41 driver
     41 dog
     41 dismisses
     41 diplomatic
     41 decline
     41 credibility
     41 broad
     41 booth
     40 washpost
     40 vincent
     40 tyler
     40 stone
     40 spreading
     40 sorry
     40 sane
     40 richmond
     40 redeployment
     40 present
     40 perspective
     40 paulson
     40 panic
     40 nature
     40 mom
     40 michigan
     40 influence
     40 hotel
     40 followed
     40 fauquier
     40 eventually
     40 engineering
     40 employers
     40 egypt
     40 delays
     40 consumer
     40 constitution
     40 completely
     40 colbert
     40 christian
     40 choice
     40 checks
     40 buyers
     40 bridge
     40 birth
     40 below
     40 beirut
     40 assets
     40 anthony
     40 addition
     40 adams
     39 worrying
     39 walk
     39 valley
     39 unemployment
     39 thanksgiving
     39 standard
     39 september
     39 searches
     39 scout
     39 rosenwald
     39 revolution
     39 ran
     39 pushed
     39 pleasant
     39 physical
     39 original
     39 offering
     39 negotiations
     39 multiple
     39 mid
     39 lama
     39 knife
     39 klay
     39 juan
     39 janelle
     39 islamabad
     39 housing
     39 heat
     39 giannotto
     39 foot
     39 filters
     39 fear
     39 favors
     39 entire
     39 emergency
     39 ellen
     39 edition
     39 drew
     39 dogs
     39 described
     39 dalai
     39 cul
     39 crimeans
     39 clearly
     39 capacity
     39 campaigns
     39 aloud
     39 admissions
     39 abuse
     39 aam
     38 wire
     38 venues
     38 vehicles
     38 tokyo
     38 statue
     38 stadium
     38 shopping
     38 sac
     38 retirement
     38 raised
     38 published
     38 protests
     38 prosecutors
     38 personnel
     38 passage
     38 optional
     38 normal
     38 monae
     38 mini
     38 meets
     38 meanwhile
     38 issued
     38 hiatt
     38 fort
     38 focused
     38 fewer
     38 feature
     38 explain
     38 expand
     38 domestic
     38 demands
     38 cross
     38 criminal
     38 climate
     38 classes
     38 cause
     38 brothers
     38 boats
     38 adult
     38 administrative
     38 adblock
     38 accused
     38 accounting
     38 aaa
     37 wonder
     37 winner
     37 willing
     37 whatever
     37 wait
     37 volunteer
     37 threat
     37 sw
     37 survey
     37 studio
     37 standing
     37 specific
     37 slowly
     37 simple
     37 shines
     37 sector
     37 rockville
     37 republic
     37 removed
     37 religious
     37 reached
     37 rating
     37 quits
     37 prayer
     37 penalty
     37 path
     37 paint
     37 otherwise
     37 olympics
     37 october
     37 mysterious
     37 mt
     37 mclean
     37 matters
     37 massachusetts
     37 marc
     37 male
     37 legislative
     37 kabul
     37 habit
     37 germany
     37 fully
     37 founded
     37 formal
     37 fifth
     37 espn
     37 ensure
     37 differences
     37 die
     37 depressing
     37 corner
     37 construction
     37 concert
     37 commissioner
     37 coaches
     37 clark
     37 celebritology
     37 cartoonist
     37 britain
     37 blown
     37 blogger
     37 bits
     37 bedroom
     37 bear
     37 amount
     37 agree
     37 ads
     36 voting
     36 viewed
     36 tsarnaev
     36 tomorrow
     36 todd
     36 surveillance
     36 southwest
     36 showdown
     36 shift
     36 shah
     36 retreats
     36 represent
     36 reads
     36 quit
     36 prepared
     36 politicians
     36 playoffs
     36 philadelphia
     36 opponents
     36 operations
     36 officers
     36 nicklaus
     36 nearby
     36 medicine
     36 jersey
     36 hoping
     36 heading
     36 glenn
     36 gate
     36 figures
     36 fighting
     36 explore
     36 executives
     36 enjoy
     36 doctors
     36 disappearance
     36 difference
     36 democracy
     36 currently
     36 condition
     36 concerned
     36 concern
     36 cheese
     36 celebrity
     36 catholics
     36 cabinet
     36 built
     36 bombings
     36 bob
     36 asking
     36 arriving
     36 alert
     36 advocate
     36 acclaimed
     35 wayne
     35 vladi
     35 unique
     35 touch
     35 suggest
     35 struggles
     35 stock
     35 starr
     35 speaking
     35 sentence
     35 rounds
     35 replicaedition
     35 regret
     35 recall
     35 rebels
     35 rally
     35 raid
     35 quarterback
     35 owner
     35 overall
     35 none
     35 nate
     35 nancy
     35 nairobi
     35 mount
     35 mir
     35 miles
     35 lyndon
     35 hottest
     35 highest
     35 heads
     35 handsome
     35 grow
     35 grant
     35 fellow
     35 explains
     35 ending
     35 enablers
     35 empire
     35 drawn
     35 direct
     35 damage
     35 contractors
     35 clay
     35 classical
     35 chinatown
     35 chartered
     35 camp
     35 bullying
     35 broke
     35 bites
     35 baker
     35 august
     35 atlantic
     35 adding
     34 zanuck
     34 weren
     34 waste
     34 vacuum
     34 utah
     34 treasury
     34 trades
     34 tracks
     34 ten
     34 talent
     34 tag
     34 supervisor
     34 strip
     34 springfield
     34 shut
     34 shortly
     34 shakespeare
     34 sept
     34 san
     34 rs
     34 roxanne
     34 reelection
     34 recalled
     34 raymond
     34 pulitzer
     34 publicly
     34 provides
     34 presence
     34 powerful
     34 porter
     34 pexton
     34 observers
     34 nominee
     34 murder
     34 moments
     34 measures
     34 lively
     34 limp
     34 lake
     34 laich
     34 jump
     34 joined
     34 jo
     34 insiders
     34 injury
     34 imagine
     34 id
     34 hollywood
     34 hasn
     34 happens
     34 hagel
     34 glass
     34 gap
     34 fatally
     34 evaluation
     34 effective
     34 econ
     34 dropped
     34 disputed
     34 direction
     34 desk
     34 delhi
     34 claimed
     34 circuit
     34 caused
     34 bockis
     34 bloggers
     34 behavior
     34 ashburn
     34 anytime
     34 aides
     34 aggression
     34 afghanistan
     33 usb
     33 tw
     33 turf
     33 trillion
     33 tree
     33 toyota
     33 tied
     33 thoughts
     33 thewanreport
     33 theeconomist
     33 thebea
     33 thana
     33 texts
     33 tehran
     33 teens
     33 strikes
     33 std
     33 scoring
     33 ryong
     33 rumours
     33 route
     33 reut
     33 reston
     33 resolution
     33 reappears
     33 qcsg
     33 pressed
     33 presidency
     33 okay
     33 offered
     33 nzfog
     33 nyti
     33 ndtv
     33 nbbn
     33 moose
     33 melinda
     33 mcilroy
     33 mamma
     33 lots
     33 lebanon
     33 knock
     33 joseph
     33 jasondhorowitz
     33 ifjt
     33 harris
     33 hae
     33 gu
     33 grain
     33 gambling
     33 funny
     33 foggy
     33 feeling
     33 faa
     33 erinmcunningham
     33 ended
     33 duncan
     33 dprk
     33 disabilities
     33 devices
     33 design
     33 defies
     33 database
     33 criteria
     33 covers
     33 correction
     33 corporation
     33 consumers
     33 constitutional
     33 computers
     33 complex
     33 compassion
     33 committed
     33 chosun
     33 choe
     33 character
     33 bureaus
     33 btw
     33 brooks
     33 brookland
     33 broader
     33 boost
     33 beach
     33 balance
     33 ath
     33 ashutosh
     33 arti
     33 apprehending
     33 anupkaphle
     33 afp
     33 adviser
     33 advantage
     33 advance
     32 zone
     32 zbigniew
     32 zarate
     32 woodson
     32 watson
     32 violate
     32 uninvited
     32 tonight
     32 tenleytown
     32 strike
     32 spivack
     32 slew
     32 sister
     32 separate
     32 selling
     32 seeing
     32 scrutiny
     32 saakashvili
     32 river
     32 retired
     32 representatives
     32 refinanced
     32 ratings
     32 raises
     32 progress
     32 professional
     32 pennsylvania
     32 partnership
     32 partner
     32 parks
     32 orlando
     32 nonprofit
     32 msnbc
     32 morris
     32 morello
     32 mixed
     32 misreading
     32 mikheil
     32 merger
     32 kim
     32 joy
     32 interests
     32 interesting
     32 indianapolis
     32 ill
     32 heavy
     32 guacamole
     32 georgia
     32 frost
     32 feels
     32 fare
     32 estimates
     32 england
     32 employee
     32 economics
     32 dulles
     32 drawing
     32 discovered
     32 devon
     32 declassify
     32 cop
     32 chipotle
     32 brzezinski
     32 boy
     32 blues
     32 blocks
     32 bjp
     32 becomes
     32 baucus
     32 artists
     32 anonymously
     32 accept
     31 vision
     31 venezuela
     31 uses
     31 updated
     31 ultimately
     31 toddlers
     31 tips
     31 supplies
     31 supernanny
     31 soul
     31 software
     31 sanford
     31 repeatedly
     31 rebel
     31 quiet
     31 quality
     31 purpose
     31 pupusas
     31 proceedings
     31 principal
     31 previously
     31 picked
     31 pain
     31 obviously
     31 nuclear
     31 nosy
     31 nissan
     31 newspapers
     31 negative
     31 metadata
     31 memo
     31 marion
     31 managed
     31 loh
     31 lineup
     31 likes
     31 legacy
     31 hurts
     31 holmes
     31 guests
     31 gaza
     31 flight
     31 fish
     31 finish
     31 file
     31 failure
     31 en
     31 empty
     31 ely
     31 earned
     31 disabled
     31 demand
     31 deliver
     31 debut
     31 daniel
     31 dad
     31 creating
     31 crash
     31 completing
     31 chamber
     31 captain
     31 broadband
     31 brazil
     31 bonnie
     31 benwick
     31 believes
     31 athletic
     31 arrived
     31 actual
     31 actor
     31 acting
     31 accomplished
     30 worried
     30 woodley
     30 woodbridge
     30 whitlock
     30 wedding
     30 tysons
     30 tebow
     30 task
     30 takeover
     30 surprised
     30 suggested
     30 sterling
     30 spain
     30 shoulder
     30 shop
     30 semis
     30 seeking
     30 returned
     30 respect
     30 remarks
     30 quake
     30 pull
     30 possibility
     30 positive
     30 peterson
     30 perform
     30 paying
     30 particular
     30 paris
