   7447 the
   4305 to
   4179 nytimes
   3653 and
   3607 a
   3560 for
   3489 in
   3343 s
   3224 com
   2899 of
   2670 times
   2072 access
   1977 digital
   1751 unlimited
   1749 new
   1598 home
   1510 york
   1324 movies
   1322 apps
   1251 today
   1210 log
   1205 u
   1175 search
   1175 all
   1135 that
   1108 by
   1061 just
   1022 try
   1020 on
   1014 from
    972 now
    966 subscriber
    895 subscription
    888 health
    853 delivery
    837 winning
    830 award
    822 tv
    822 experience
    802 travel
    796 video
    789 most
    780 you
    779 or
    778 help
    761 page
    747 world
    743 app
    734 is
    728 with
    710 business
    698 n
    684 get
    678 opinion
    675 y
    670 register
    667 popular
    666 real
    665 sports
    664 style
    664 arts
    660 paper
    652 estate
    647 technology
    647 region
    635 science
    624 jobs
    615 any
    602 autos
    595 weeks
    588 best
    587 feedback
    585 as
    576 more
    565 windows
    563 android
    557 your
    545 this
    528 smartphone
    525 device
    524 here
    518 powered
    518 march
    514 are
    507 start
    501 account
    498 showtimes
    498 choose
    496 already
    489 phone
    485 link
    481 friday
    480 iphone
    479 at
    478 phones
    478 blackberry
    465 edition
    457 global
    451 it
    442 become
    425 be
    414 journalism
    392 about
    391 was
    385 rsq
    350 week
    348 his
    348 he
    338 free
    338 an
    333 first
    313 zip
    313 code
    302 back
    300 not
    292 have
    288 role
    279 subscribe
    278 pain
    278 four
    275 what
    270 can
    264 but
    261 every
    255 had
    254 their
    254 i
    253 after
    249 am
    241 one
    237 may
    235 who
    233 will
    233 people
    231 they
    227 topics
    217 person
    217 cast
    209 trailer
    209 television
    209 review
    207 pm
    203 buy
    199 other
    197 has
    194 time
    190 t
    188 up
    188 articles
    183 director
    182 her
    180 listings
    179 ipad
    174 when
    174 toney
    171 she
    167 books
    165 low
    164 off
    163 been
    158 some
    156 also
    154 print
    151 movie
    149 book
    147 out
    147 news
    146 rate
    146 guide
    146 e
    143 watch
    143 exercise
    142 theaters
    142 no
    141 than
    140 only
    139 archive
    138 day
    136 lolli
    136 include
    136 gift
    136 details
    136 coming
    135 were
    135 said
    134 m
    130 should
    128 photography
    127 its
    127 do
    127 critics
    125 soon
    125 see
    124 shows
    124 period
    124 patients
    124 diabetes
    123 show
    123 media
    122 tickets
    122 our
    122 like
    121 which
    118 if
    115 over
    115 city
    113 there
    112 us
    112 per
    111 into
    110 picks
    110 d
    108 tablet
    106 trailers
    104 local
    102 them
    102 such
    101 web
    101 sales
    100 many
    100 fire
    100 credits
    100 children
     99 production
     99 map
     98 nina
     98 go
     97 so
     96 store
     95 two
     95 how
     94 last
     94 collection
     93 subscriptions
     92 years
     91 dvd
     91 billed
     90 spinal
     90 introductory
     90 crosswords
     90 barnes
     89 decoder
     88 would
     88 special
     88 my
     88 long
     88 high
     87 options
     87 blood
     86 noble
     86 man
     86 amazon
     85 site
     85 kindle
     85 chrome
     85 booksellers
     85 actor
     84 information
     83 three
     82 these
     81 list
     81 history
     80 post
     79 nyt
     79 american
     77 we
     76 those
     76 policy
     75 down
     74 well
     74 type
     74 through
     74 him
     74 family
     73 way
     73 need
     73 company
     72 found
     71 find
     70 spine
     69 take
     69 still
     69 slide
     69 before
     68 risk
     67 theater
     67 terms
     67 life
     67 education
     66 hotel
     66 heart
     65 treatment
     65 premium
     65 hide
     65 even
     65 between
     64 work
     64 fat
     64 early
     64 c
     63 use
     63 features
     63 assistant
     62 x
     62 multimedia
     62 could
     61 awards
     61 ad
     60 surgery
     60 number
     60 artsbeat
     59 weight
     59 ukraine
     59 story
     59 house
     59 fashion
     58 privacy
     58 magazine
     57 used
     57 national
     57 fiction
     57 each
     56 visit
     56 report
     56 regularly
     56 month
     56 men
     56 gas
     55 prison
     55 cause
     54 where
     54 make
     54 hours
     54 group
     54 art
     53 money
     53 learn
     52 year
     52 symptoms
     52 share
     52 p
     52 levels
     52 grand
     52 effects
     52 called
     51 while
     51 top
     51 often
     51 during
     50 women
     50 series
     50 research
     50 part
     50 international
     50 insulin
     50 guides
     50 et
     50 care
     50 calories
     50 body
     49 war
     49 index
     49 disk
     49 date
     49 big
     48 view
     48 under
     48 subscribers
     48 restaurants
     48 own
     48 don
     48 contact
     47 then
     47 offer
     47 music
     47 film
     47 dies
     47 both
     46 too
     46 tablets
     46 paperback
     46 once
     46 michael
     46 little
     46 lists
     46 disease
     46 corporate
     45 using
     45 supervisor
     45 small
     45 problems
     45 law
     45 john
     45 inman
     45 foods
     45 energy
     45 close
     45 blog
     45 benefits
     45 around
     44 sugar
     44 sections
     44 producer
     44 place
     44 member
     44 j
     44 inside
     44 fitness
     44 credit
     44 baby
     43 very
     43 latest
     43 island
     43 end
     43 daily
     43 biography
     42 side
     42 sellers
     42 physical
     42 office
     42 nutrition
     42 food
     41 united
     41 students
     41 states
     41 service
     41 room
     41 restrictions
     41 offers
     41 o
     41 night
     41 much
     41 medical
     41 love
     41 important
     41 glucose
     41 days
     41 crew
     41 car
     41 behind
     41 apply
     41 again
     40 washington
     40 want
     40 test
     40 stop
     40 read
     40 r
     40 next
     40 master
     40 lower
     40 full
     40 face
     40 ed
     40 does
     40 did
     40 complete
     40 choice
     40 because
     39 studies
     39 set
     39 please
     39 nerve
     39 great
     39 father
     39 creative
     39 center
     38 young
     38 select
     38 russia
     38 rss
     38 protein
     38 pressure
     38 ny
     38 mr
     38 ll
     38 k
     38 going
     38 feature
     38 chronic
     37 standards
     37 song
     37 sale
     37 however
     37 following
     37 dealbook
     37 david
     37 choices
     37 budapest
     37 being
     37 b
     37 among
     36 state
     36 sat
     36 published
     36 provide
     36 power
     36 past
     36 old
     36 might
     36 loss
     36 less
     36 hotels
     36 hardcover
     36 garden
     36 few
     36 diet
     36 depth
     36 carbohydrates
     36 cancer
     36 call
     36 advertise
     36 adults
     36 abtest
     35 yes
     35 why
     35 white
     35 views
     35 vendors
     35 section
     35 right
     35 reflect
     35 prices
     35 overview
     35 mother
     35 me
     35 including
     35 future
     35 college
     35 bone
     35 bill
     35 al
     34 scene
     34 reported
     34 muscles
     34 lost
     34 job
     34 html
     34 filmography
     34 fats
     34 along
     33 www
     33 within
     33 vertebrae
     33 study
     33 south
     33 shown
     33 red
     33 program
     33 patient
     33 noon
     33 never
     33 meat
     33 making
     33 made
     33 better
     33 another
     32 term
     32 re
     32 president
     32 position
     32 photos
     32 nonfiction
     32 market
     32 know
     32 interest
     32 h
     32 good
     32 former
     32 evidence
     31 without
     31 whether
     31 street
     31 related
     31 products
     31 near
     31 industry
     31 general
     31 editor
     31 dietary
     31 common
     31 away
     31 available
     31 asked
     31 always
     31 against
     30 traveler
     30 says
     30 rates
     30 online
     30 north
     30 move
     30 morning
     30 girl
     30 g
     30 exercises
     30 clear
     30 cases
     30 article
     29 v
     29 usually
     29 th
     29 plan
     29 moved
     29 kidney
     29 intake
     29 indicates
     29 factors
     29 eyes
     29 editors
     29 dollars
     29 desktop
     29 come
     29 associate
     29 age
     28 whole
     28 town
     28 titles
     28 since
     28 readers
     28 possible
     28 newspaper
     28 natural
     28 location
     28 interactive
     28 got
     28 far
     28 email
     28 america
     27 until
     27 trade
     27 supplements
     27 send
     27 paris
     27 outside
     27 others
     27 order
     27 oil
     27 editorial
     27 control
     27 conditions
     27 classifieds
     27 classified
     27 black
     27 avoid
     27 above
     26 ways
     26 users
     26 university
     26 thereafter
     26 starting
     26 son
     26 school
     26 reduce
     26 promotional
     26 lead
     26 girls
     26 fish
     26 different
     26 didn
     26 debate
     26 country
     26 condition
     26 companies
     26 cars
     26 beyond
     26 association
     26 andrew
     25 weekend
     25 website
     25 wall
     25 support
     25 seen
     25 say
     25 save
     25 recent
     25 raleigh
     25 pre
     25 paul
     25 orleans
     25 non
     25 hard
     25 groups
     25 graphic
     25 fresh
     25 fiber
     25 disks
     25 diagnosis
     25 cards
     25 benefit
     25 area
     25 analysis
     25 activities
     24 ultimate
     24 things
     24 texas
     24 sound
     24 shale
     24 road
     24 puzzle
     24 provides
     24 provided
     24 preview
     24 pages
     24 op
     24 note
     24 mobile
     24 minute
     24 military
     24 known
     24 journey
     24 firm
     24 f
     24 event
     24 enough
     24 effect
     24 data
     24 child
     24 check
     24 certain
     24 causes
     24 capital
     24 campaign
     24 brown
     24 attacks
     23 water
     23 team
     23 sunday
     23 single
     23 sex
     23 return
     23 questions
     23 pregnant
     23 plus
     23 places
     23 picture
     23 particularly
     23 particular
     23 lee
     23 half
     23 grams
     23 gives
     23 ever
     23 europe
     23 categories
     23 bitcoin
     23 associated
     23 able
     22 wine
     22 west
     22 together
     22 therapy
     22 taking
     22 stay
     22 sometimes
     22 schools
     22 robert
     22 public
     22 previous
     22 potassium
     22 placed
     22 pictures
     22 packages
     22 nantucket
     22 must
     22 muscle
     22 lumbar
     22 look
     22 lives
     22 large
     22 ily
     22 game
     22 follow
     22 drug
     22 doctors
     22 die
     22 determine
     22 crimea
     22 content
     22 class
     22 change
     22 box
     22 bones
     22 advice
     22 activity
     21 trial
     21 takes
     21 stories
     21 several
     21 seeing
     21 rubio
     21 ride
     21 retailers
     21 rankings
     21 q
     21 pushes
     21 publishers
     21 political
     21 personal
     21 officials
     21 monument
     21 mind
     21 mail
     21 leg
     21 least
     21 learning
     21 l
     21 james
     21 independent
     21 increase
     21 image
     21 feet
     21 doctor
     21 diets
     21 dead
     21 current
     21 cold
     21 cholesterol
     21 china
     21 carbohydrate
     21 break
     21 boy
     20 wanted
     20 vote
     20 trying
     20 trip
     20 total
     20 told
     20 think
     20 tests
     20 strength
     20 specific
     20 severe
     20 scott
     20 richard
     20 point
     20 play
     20 park
     20 official
     20 nsaids
     20 needed
     20 nd
     20 mark
     20 looked
     20 left
     20 la
     20 jobe
     20 islands
     20 himself
     20 hijackers
     20 glycemic
     20 favorite
     20 dog
     20 devices
     20 copyright
     20 compare
     20 comics
     20 battle
     20 arthritis
     20 amount
     20 across
     19 yet
     19 wasn
     19 visitor
     19 universe
     19 toward
     19 though
     19 stenosis
     19 staff
     19 sightseeing
     19 short
     19 senate
     19 sciatica
     19 procedure
     19 plans
     19 neighborhood
     19 name
     19 months
     19 longer
     19 journal
     19 jennifer
     19 immigration
     19 having
     19 getting
     19 friends
     19 foreign
     19 exchange
     19 especially
     19 double
     19 disney
     19 department
     19 death
     19 cost
     19 cord
     19 character
     19 capacity
     19 browse
     19 anderson
     19 accused
     18 walk
     18 ve
     18 vacation
     18 turned
     18 tommy
     18 todd
     18 targetedpage
     18 spent
     18 ship
     18 settings
     18 self
     18 sea
     18 russian
     18 recengine
     18 receive
     18 reader
     18 pro
     18 olympics
     18 notebook
     18 nation
     18 major
     18 main
     18 looking
     18 lies
     18 included
     18 hope
     18 higher
     18 happened
     18 george
     18 frank
     18 events
     18 done
     18 digi
     18 delivered
     18 croatia
     18 click
     18 century
     18 calorie
     18 bring
     18 bigad
     18 begins
     18 basketball
     18 annual
     18 acute
     17 whale
     17 walking
     17 tech
     17 stress
     17 something
     17 social
     17 sites
     17 sign
     17 serious
     17 second
     17 season
     17 run
     17 redemption
     17 receiving
     17 purchase
     17 publisher
     17 press
     17 posts
     17 points
     17 orders
     17 nights
     17 nicaragua
     17 minutes
     17 million
     17 medications
     17 meal
     17 mass
     17 lifting
     17 india
     17 given
     17 fusion
     17 friend
     17 forward
     17 feb
     17 environment
     17 east
     17 drugs
     17 democrats
     17 cycle
     17 convenience
     17 commonly
     17 cancel
     17 believe
     17 austin
     17 attack
     17 almost
     17 allow
     17 acids
     17 abortion
     16 winter
     16 window
     16 w
     16 visits
     16 visitors
     16 various
     16 tools
     16 took
     16 themselves
     16 terror
     16 teacher
     16 sweet
     16 sweeney
     16 streets
     16 star
     16 st
     16 sponsored
     16 six
     16 sent
     16 seller
     16 same
     16 row
     16 rights
     16 reading
     16 prospects
     16 plot
     16 open
     16 obama
     16 mysterious
     16 museum
     16 looks
     16 leading
     16 later
     16 japan
     16 instead
     16 infection
     16 inc
     16 improve
     16 impact
     16 highlights
     16 harvard
     16 fronts
     16 flight
     16 five
     16 finney
     16 feel
     16 faq
     16 explanation
     16 experiencing
     16 either
     16 educators
     16 discount
     16 destinations
     16 design
     16 de
     16 chief
     16 case
     16 carolina
     16 capitol
     16 british
     16 boylan
     16 billing
     16 barely
     16 bar
     16 although
     15 woman
     15 whales
     15 turn
     15 true
     15 treatments
     15 training
     15 tracked
     15 tourist
     15 system
     15 snow
     15 slave
     15 similar
     15 security
     15 revive
     15 revisiting
     15 regular
     15 recommends
     15 ranked
     15 photographs
     15 perform
     15 package
     15 ocean
     15 numbness
     15 network
     15 necessary
     15 measure
     15 limit
     15 let
     15 leaders
     15 july
     15 january
     15 homes
     15 head
     15 growing
     15 green
     15 government
     15 give
     15 gets
     15 generally
     15 front
     15 fractures
     15 finding
     15 fever
     15 fatty
     15 economy
     15 directory
     15 dining
     15 dance
     15 columns
     15 columnist
     15 codes
     15 co
     15 clinics
     15 changes
     15 central
     15 board
     15 areas
     15 africa
     14 working
     14 william
     14 weighted
     14 thousands
     14 teenagers
     14 suspected
     14 soy
     14 significant
     14 sherman
     14 rise
     14 restaurant
     14 remain
     14 relief
     14 recommended
     14 range
     14 put
     14 plays
     14 peabody
     14 oscars
     14 older
     14 nuts
     14 milk
     14 live
     14 likely
     14 letters
     14 legs
     14 leads
     14 late
     14 labels
     14 keep
     14 images
     14 huge
     14 hot
     14 heroin
     14 herniated
     14 hands
     14 ground
     14 gone
     14 gold
     14 gave
     14 fruits
     14 formats
     14 form
     14 festival
     14 fall
     14 executives
     14 entertainment
     14 election
     14 download
     14 distinguishable
     14 difficult
     14 depression
     14 dancers
     14 dairy
     14 dagger
     14 cultured
     14 creator
     14 craft
     14 corroboration
     14 commercial
     14 charge
     14 came
     14 bulk
     14 brooklyn
     14 boys
     14 blasio
     14 ballet
     14 bad
     14 asterisk
     14 artist
     14 ann
     13 yoga
     13 worse
     13 workers
     13 wind
     13 wife
     13 wide
     13 whose
     13 wes
     13 wants
     13 vol
     13 voice
     13 vital
     13 vertebra
     13 vermont
     13 trips
     13 trippy
     13 tried
     13 tips
     13 thomas
     13 tati
     13 talk
     13 table
     13 summer
     13 speed
     13 space
     13 smartphones
     13 smart
     13 sleep
     13 simply
     13 sexual
     13 scourge
     13 rooms
     13 reports
     13 randomized
     13 radio
     13 protest
     13 properties
     13 powerful
     13 potential
     13 pick
     13 normal
     13 needs
     13 nearly
     13 multiple
     13 metro
     13 members
     13 med
     13 martin
     13 lesson
     13 knees
     13 kill
     13 kids
     13 jones
     13 involved
     13 injuries
     13 includes
     13 hour
     13 host
     13 hospital
     13 hold
     13 hill
     13 helps
     13 held
     13 hearing
     13 grains
     13 god
     13 frequently
     13 eye
     13 expected
     13 effort
     13 due
     13 distributor
     13 destination
     13 dc
     13 damage
     13 customer
     13 coverage
     13 courtesy
     13 corrections
     13 corner
     13 chocolate
     13 cheney
     13 caused
     13 bronx
     13 bittersweet
     13 below
     13 becomes
     13 basic
     13 baseball
     13 authorities
     13 athletes
     13 appearance
     13 added
     13 accounting
     13 according
     12 yesterday
     12 won
     12 wire
     12 win
     12 wildebeest
     12 western
     12 weddings
     12 weather
     12 wars
     12 warm
     12 violence
     12 version
     12 vegetables
     12 valley
     12 useful
     12 twitter
     12 trouble
     12 trail
     12 thought
     12 theatrical
     12 thanks
     12 tax
     12 taken
     12 success
     12 step
     12 stand
     12 slow
     12 serving
     12 services
     12 seniors
     12 screen
     12 scratching
     12 scale
     12 risks
     12 rich
     12 results
     12 result
     12 rest
     12 required
     12 recently
     12 ray
     12 ralph
     12 question
     12 quality
     12 procedures
     12 prepared
     12 politics
     12 police
     12 performed
     12 parts
     12 osteoporosis
     12 option
     12 occurs
     12 mystery
     12 myself
     12 mri
     12 morn
     12 miss
     12 medicine
     12 meals
     12 marianas
     12 makes
     12 lung
     12 lose
     12 lifestyle
     12 knopf
     12 king
     12 killing
     12 key
     12 juvenile
     12 jay
     12 issue
     12 investigators
     12 investigation
     12 inmates
     12 injury
     12 inflammatory
     12 indianapolis
     12 heat
     12 guidelines
     12 grip
     12 fighting
     12 federals
     12 federal
     12 fact
     12 faces
     12 experts
     12 executive
     12 eve
     12 era
     12 episodes
     12 enjoy
     12 effective
     12 ears
     12 dr
     12 disorders
     12 diary
     12 departing
     12 daughters
     12 currently
     12 cup
     12 culture
     12 controlled
     12 continue
     12 considered
     12 computer
     12 compared
     12 comedy
     12 classroom
     12 chris
     12 briefing
     12 brian
     12 bread
     12 booming
     12 blind
     12 becoming
     12 beans
     12 batman
     12 bank
     12 athens
     12 arms
     12 amid
     12 ages
     12 afterward
     12 aerobic
     12 advanced
     12 action
     12 achieve
     11 yale
     11 wrote
     11 works
     11 went
     11 upper
     11 understand
     11 turning
     11 truth
     11 tale
     11 substitutes
     11 stores
     11 stephen
     11 stage
     11 square
     11 smith
     11 sister
     11 simon
     11 shelter
     11 saturated
     11 salt
     11 roy
     11 roots
     11 reviews
     11 reviewed
     11 resistance
     11 recipes
     11 rather
     11 ramen
     11 race
     11 push
     11 publishing
     11 providing
     11 provider
     11 produce
     11 problem
     11 private
     11 plenty
     11 pioneered
     11 particle
     11 oscar
     11 original
     11 opened
     11 nerves
     11 nantucketers
     11 movement
     11 mexico
     11 mets
     11 meet
     11 matter
     11 match
     11 malta
     11 maintain
     11 llc
     11 level
     11 land
     11 journals
     11 joints
     11 intern
     11 injections
     11 increases
     11 increased
     11 ignored
     11 hit
     11 historians
     11 healthy
     11 heads
     11 games
     11 france
     11 focus
     11 films
     11 fear
     11 fda
     11 except
     11 established
     11 essex
     11 easy
     11 earth
     11 drink
     11 division
     11 develop
     11 daughter
     11 dark
     11 daniel
     11 cultural
     11 crowd
     11 course
     11 contain
     11 concern
     11 complications
     11 column
     11 clinical
     11 chapter
     11 chance
     11 casting
     11 buttocks
     11 bush
     11 bob
     11 bits
     11 bike
     11 beneficial
     11 begin
     11 beauty
     11 author
     11 artificial
     11 archipelago
     11 alternative
     11 air
     11 advertising
     11 adult
     11 adopted
     11 abroad
     10 writing
     10 word
     10 weakness
     10 wave
     10 voices
     10 village
     10 viewed
     10 unit
     10 traffic
     10 tours
     10 touch
     10 toronto
     10 title
     10 supported
     10 sun
     10 suggests
     10 stood
     10 stomach
     10 started
     10 spotlight
     10 smoke
     10 skin
     10 sitting
     10 seven
     10 seth
     10 seemed
     10 searchselect
     10 saying
     10 saw
     10 rules
     10 royceother
     10 roverlexuslincolnmaseratimaybachmazdamercedes
     10 respond
     10 resort
     10 replica
     10 relationship
     10 references
     10 recommend
     10 really
     10 quickly
     10 proteins
     10 professional
     10 process
     10 prevention
     10 potato
     10 port
     10 pillowmovie
     10 philadelphia
     10 pelvic
     10 organizations
     10 opera
     10 omega
     10 offering
     10 obtain
     10 novels
     10 neck
     10 narrates
     10 names
     10 monuments
     10 menu
     10 matters
     10 martinaudibentleybmwbuickcadillacchevroletchryslerdodgeferrarifordgmchondahummerhyundaiinfinitiisuzujaguarjeepkialamborghiniland
     10 marriage
     10 majority
     10 lot
     10 locked
     10 living
     10 listed
     10 lincoln
     10 liked
     10 light
     10 leaving
     10 laminectomy
     10 killed
     10 kiev
     10 kept
     10 joy
     10 jonathan
     10 johnson
     10 jack
     10 itself
     10 interior
     10 influence
     10 increasing
     10 identified
     10 icon
     10 hurt
     10 hunt
     10 homepage
     10 higgins
     10 harpercollins
     10 hall
     10 hair
     10 greenwire
     10 gay
     10 fully
     10 frugal
     10 forces
     10 football
     10 financial
     10 filled
     10 fight
     10 expert
     10 everything
     10 error
     10 entrepreneur
     10 emerging
     10 editions
     10 economic
     10 dressed
     10 door
     10 diplomatic
     10 despite
     10 deal
     10 dancer
     10 cut
     10 cruise
     10 creatures
     10 conference
     10 commanders
     10 combined
     10 club
     10 closed
     10 christie
     10 charged
     10 changing
     10 chairman
     10 celebration
     10 cake
     10 bus
     10 brought
     10 broadway
     10 broader
     10 brain
     10 born
     10 benzmercuryminimitsubishinissanoldsmobilepanozplymouthpontiacporschesaabsaturnscionsubarusuzukitoyotavolkswagenvolvomgrolls
     10 began
     10 based
     10 balance
     10 approach
     10 appears
     10 amounts
     10 alone
     10 alice
     10 ago
     10 african
     10 affect
     10 acuraaston
     10 acupuncture
     10 aaron
      9 yourself
      9 wins
      9 wheel
      9 weak
      9 waiting
      9 virginia
      9 vienna
      9 videos
      9 van
      9 urac
      9 update
      9 universal
      9 trauma
      9 tissue
      9 thursday
      9 throughout
      9 thinking
      9 thing
      9 thin
      9 techniques
      9 taste
      9 surgical
      9 sure
      9 sundays
      9 sugars
      9 subacute
      9 strong
      9 straight
      9 steve
      9 stephanie
      9 standing
      9 spring
      9 spots
      9 spondylolisthesis
      9 sources
      9 source
      9 songs
      9 sights
      9 shore
      9 shopping
      9 sfmiddle
      9 sets
      9 running
      9 rock
      9 river
      9 response
      9 resources
      9 reserved
      9 requirement
      9 reporting
      9 reporter
      9 remove
      9 release
      9 refund
      9 reflects
      9 reference
      9 reducing
      9 record
      9 quite
      9 property
      9 project
      9 produced
      9 playing
      9 plant
      9 phosphorus
      9 peter
      9 pay
      9 pair
      9 pacific
      9 overweight
      9 ongoing
      9 olympic
      9 novel
      9 nothing
      9 noted
      9 nickerson
      9 middle
      9 mg
      9 met
      9 memory
      9 mediterranean
      9 means
      9 meaning
      9 maxim
      9 manga
      9 machine
      9 lived
      9 line
      9 limbaugh
      9 lights
      9 leboeuf
      9 learned
      9 league
      9 kugel
      9 knicks
      9 knew
      9 kid
      9 jersey
      9 jan
      9 inspiration
      9 influences
      9 imaging
      9 hungry
      9 hip
      9 herbal
      9 heavy
      9 hand
      9 guest
      9 grow
      9 gregory
      9 grabs
      9 getaway
      9 generation
      9 gastrointestinal
      9 function
      9 french
      9 fraud
      9 fox
      9 foot
      9 flights
      9 flavor
      9 finally
      9 field
      9 feeling
      9 families
      9 falls
      9 failed
      9 exception
      9 example
      9 essays
      9 ending
      9 electronic
      9 eden
      9 dna
      9 diskectomy
      9 difference
      9 dewey
      9 designer
      9 depending
      9 decades
      9 dealers
      9 cuts
      9 crossword
      9 critic
      9 crisis
      9 cooked
      9 convenient
      9 contains
      9 comes
      9 coffee
      9 coach
      9 clothing
      9 closer
      9 civil
      9 church
      9 che
      9 charles
      9 charging
      9 changed
      9 cave
      9 caught
      9 cardiovascular
      9 capone
      9 calls
      9 buying
      9 built
      9 blue
      9 believed
      9 became
      9 beaches
      9 background
      9 average
      9 authority
      9 ask
      9 april
      9 anti
      9 announce
      9 americans
      9 aims
      9 ahead
      9 adam
      9 actively
      9 accepted
      9 abnormalities
      8 written
      8 woods
      8 wildlife
      8 whitney
      8 wendy
      8 weekdays
      8 wee
      8 wear
      8 weapon
      8 watching
      8 warning
      8 walked
      8 variety
      8 values
      8 usa
      8 upstate
      8 ups
      8 unrestricted
      8 unless
      8 ulcers
      8 tweet
      8 turns
      8 tuesday
      8 tool
      8 tony
      8 tom
      8 timely
      8 third
      8 temporarily
      8 tell
      8 tarzan
      8 syndrome
      8 swimming
      8 sweeteners
      8 suspended
      8 suspend
      8 supervising
      8 summariesdaily
      8 suggested
      8 suggest
      8 subscribed
      8 student
      8 standard
      8 squash
      8 speak
      8 soft
      8 sodium
      8 society
      8 slowly
      8 sky
      8 skillet
      8 simple
      8 shift
      8 shape
      8 sense
      8 senator
      8 sciatic
      8 scans
      8 sayde
      8 saving
      8 saturdays
      8 satisfied
      8 santo
      8 roof
      8 ring
      8 researchers
      8 require
      8 remember
      8 remedies
      8 remainder
      8 regional
      8 ranks
      8 quizword
      8 purchased
      8 programs
      8 prevent
      8 present
      8 preparation
      8 portable
      8 polenta
      8 photographer
      8 performance
      8 peace
      8 payment
      8 path
      8 pass
      8 party
      8 painted
      8 october
      8 object
      8 northern
      8 nature
      8 nationwide
      8 movements
      8 mountain
      8 moscow
      8 mississippi
      8 misinformed
      8 minnesota
      8 mild
      8 memoir
      8 matthew
      8 material
      8 marmalade
      8 management
      8 magnesium
      8 lying
      8 longstreet
      8 lines
      8 limited
      8 lego
      8 led
      8 leather
      8 leader
      8 larry
      8 labor
      8 kindergarten
      8 kind
      8 jr
      8 joint
      8 jeff
      8 introduced
      8 intervertebral
      8 install
      8 influx
      8 inflammation
      8 ii
      8 ice
      8 human
      8 hockey
      8 helpful
      8 headache
      8 happy
      8 gun
      8 growth
      8 groupsubs
      8 greatest
      8 gratin
      8 goldstein
      8 goal
      8 globe
      8 ghost
      8 fruit
      8 floor
      8 file
      8 fewer
      8 felt
      8 faculty
      8 facebook
      8 expires
      8 expire
      8 excludes
      8 equina
      8 emailed
      8 else
      8 electrician
      8 edit
      8 donate
      8 dolan
      8 doing
      8 discounted
      8 dim
      8 digitalaccess
      8 diabetic
      8 developing
      8 described
      8 decisions
      8 dancing
      8 ct
      8 cross
      8 crime
      8 court
      8 count
      8 council
      8 couldn
      8 conversation
      8 conventional
      8 connection
      8 confirmation
      8 compete
      8 commonwealth
      8 combat
      8 clothes
      8 cigarettes
      8 chest
      8 chef
      8 characters
      8 challenged
      8 chains
      8 cell
      8 cauda
      8 carpet
      8 career
      8 cannot
      8 cancellation
      8 camera
      8 california
      8 calendar
      8 butternut
      8 building
      8 brothers
      8 brooks
      8 breweries
      8 breaking
      8 bloody
      8 biotech
      8 bending
      8 bed
      8 awash
      8 avenida
      8 authorized
      8 attending
      8 assault
      8 ashley
      8 artists
      8 arrested
      8 approves
      8 apparent
      8 antidepressants
      8 ambitious
      8 allowance
      8 alcohol
      8 afghanistan
      8 affected
      8 administration
      8 abroadissa
      7 zinc
      7 worried
      7 workbooks
      7 wood
      7 weighs
      7 weigh
      7 weekson
      7 waist
      7 volume
      7 viz
      7 vitamin
      7 vietnam
      7 venues
      7 vendor
      7 vast
      7 ugly
      7 twenty
      7 turner
      7 turmoil
      7 truck
      7 troubling
      7 tricks
      7 trench
      7 tree
      7 traditional
      7 tract
      7 tiny
      7 tingling
      7 tied
      7 threat
      7 thick
      7 textbooks
      7 technique
      7 teachers
      7 talking
      7 suspect
      7 surveys
      7 supporting
      7 supermarkets
      7 stunning
      7 stretching
      7 streetscapes
      7 strain
      7 stopped
      7 statistically
      7 southwest
      7 sochi
      7 slightly
      7 slalom
      7 skip
      7 situated
      7 sit
      7 sin
      7 silicon
      7 showed
      7 settled
      7 sept
      7 sellersdancemoviesmusictelevisiontheater
      7 schuster
      7 scan
      7 samson
      7 safe
      7 rum
      7 royalty
      7 root
      7 rewrite
      7 reviewbest
      7 revenge
      7 reuters
      7 returning
      7 retreat
      7 retirement
      7 represent
      7 remains
      7 relieving
      7 regardless
      7 rapidly
      7 random
      7 ran
      7 raised
      7 raise
      7 quiet
      7 quaint
      7 puzzles
      7 pursue
      7 promoting
      7 progress
      7 probably
      7 primary
      7 presently
      7 presented
      7 prep
      7 politicians
      7 planning
      7 photo
      7 personality
      7 perhaps
      7 performer
      7 perennial
      7 percutaneous
      7 percent
      7 peninsula
      7 pee
      7 passages
      7 paperbacks
      7 paid
      7 owner
      7 overtakes
      7 overhaul
      7 overall
      7 outlets
      7 opioids
      7 operator
      7 opens
      7 offices
      7 occur
      7 obituaries
      7 newsstands
      7 neurological
      7 named
      7 murder
      7 murakami
      7 morrow
      7 moderate
      7 missed
      7 misc
      7 mike
      7 mighty
      7 methodology
      7 mercury
      7 medication
      7 measures
      7 mean
      7 mary
      7 marine
      7 manhattan
      7 mammoth
      7 madame
      7 links
      7 lessons
      7 leave
      7 laws
      7 kitchen
      7 jerry
      7 jail
      7 isbn
      7 invasive
      7 interview
      7 inner
      7 injured
      7 individual
      7 imagine
      7 ihs
      7 identification
      7 ideas
      7 hussein
      7 husband
      7 houston
      7 housing
      7 houses
      7 hollywood
      7 holland
      7 hijacking
      7 herszenhorn
      7 herself
      7 helped
      7 hear
      7 harbor
      7 greece
      7 giants
      7 giant
      7 germany
      7 genes
      7 further
      7 frozen
      7 friendly
      7 format
      7 flexibility
      7 fires
      7 finds
      7 fears
      7 falling
      7 fair
      7 extremely
      7 explore
      7 explain
      7 expanded
      7 exclusively
      7 eventually
      7 ethnic
      7 emotional
      7 embracing
      7 electrical
      7 eisbn
      7 editorials
      7 eat
      7 dropped
      7 dresser
      7 doors
      7 dominican
      7 domingo
      7 domestic
      7 discuss
      7 directly
      7 directed
      7 dinner
      7 development
      7 determined
      7 designers
      7 designbookssunday
      7 del
      7 daylight
      7 danger
      7 counters
      7 cooper
      7 controversial
      7 construction
      7 conservative
      7 congress
      7 conformed
      7 conflicts
      7 confidentially
      7 compression
      7 complex
      7 colon
      7 coast
      7 climate
      7 cities
      7 chinese
      7 checked
      7 chair
      7 cartoons
      7 cape
      7 canal
      7 camps
      7 campaigns
      7 calm
      7 build
      7 boyfriend
      7 boycott
      7 bought
      7 boom
      7 bookstores
      7 blueprint
      7 blocks
      7 block
      7 bleeding
      7 blamed
      7 birth
      7 biggest
      7 beta
      7 ben
      7 beginning
      7 beat
      7 beach
      7 bay
      7 banks
      7 bangalore
      7 backs
      7 assisting
      7 army
      7 armstrong
      7 argument
      7 aren
      7 anything
      7 angel
      7 alerts
      7 advantages
      7 addition
      7 act
      7 acknowledging
      7 academy
      7 abnormal
      7 ability
      7 abandoned
      6 zaffaroni
      6 z
      6 wurm
      6 writer
      6 write
      6 wortham
      6 words
      6 woodbourne
      6 wives
      6 witnesses
      6 williams
      6 whom
      6 whaling
      6 wayne
      6 vulnerable
      6 visiting
      6 violent
      6 vertebroplasty
      6 venezuela
      6 uses
      6 urban
      6 upon
      6 union
      6 typically
      6 tube
      6 tries
      6 tribute
      6 trials
      6 treat
      6 trans
      6 tracking
      6 thus
      6 threats
      6 theme
      6 tensions
      6 talks
      6 takashi
      6 sushi
      6 survey
      6 supply
      6 streaming
      6 strategy
      6 stimulation
      6 steven
      6 stars
      6 spread
      6 spot
      6 split
      6 sperm
      6 spain
      6 someone
      6 smile
      6 slipped
      6 silencing
      6 signs
      6 showcase
      6 shops
      6 shifter
      6 setting
      6 sentence
      6 selling
      6 seed
      6 secretary
      6 seconds
      6 secession
      6 seat
      6 score
      6 satellite
      6 safety
      6 sacrum
      6 russians
      6 runs
      6 rosenbloom
      6 rises
      6 rice
      6 reputation
      6 repel
      6 repeat
      6 remembers
      6 reluctant
      6 relieve
      6 relationships
      6 rejects
      6 rejected
      6 regulations
      6 recovery
      6 reach
      6 rare
      6 rain
      6 queens
      6 putnam
      6 pulled
      6 psychological
      6 protective
      6 profile
      6 professor
      6 processes
      6 price
      6 pretty
      6 pressed
      6 presence
      6 practice
      6 pound
      6 potatoes
      6 positive
      6 poorest
      6 poor
      6 polyunsaturated
      6 polio
      6 plumage
      6 plastic
      6 pitfalls
      6 pillow
      6 perth
      6 persistent
      6 periods
      6 perception
      6 pays
      6 patrick
      6 pasta
      6 parker
      6 paralympics
      6 panel
      6 painful
      6 outcome
      6 oppressive
      6 oils
      6 obesity
      6 oak
      6 nutrients
      6 numbers
      6 nucleus
      6 norton
      6 niche
      6 newspapers
      6 neutralize
      6 net
      6 negotiations
      6 nearest
      6 nash
      6 narrowed
      6 mozambique
      6 moves
      6 mouth
      6 motor
      6 monthly
      6 moment
      6 mixer
      6 mix
      6 miles
      6 mic
      6 meant
      6 materials
      6 marco
      6 manohla
      6 manny
      6 manipulation
      6 mania
      6 maine
      6 madrid
      6 machines
      6 lust
      6 lurks
      6 losing
      6 liz
      6 listing
      6 lie
      6 letter
      6 leonard
      6 larger
      6 lanterns
      6 lack
      6 keeping
      6 keen
      6 june
      6 jump
      6 joyce
      6 jim
      6 jenna
      6 ivy
      6 issa
      6 involves
      6 investors
      6 intensity
      6 initial
      6 inducing
      6 increasingly
      6 imposed
      6 importer
      6 immunization
      6 idea
      6 ian
      6 hunting
      6 hundreds
      6 honeymooners
      6 holding
      6 historical
      6 herein
      6 henry
      6 heightened
      6 harvey
      6 harsh
      6 guam
      6 grown
      6 grey
      6 grew
      6 greater
      6 grain
      6 gordon
      6 girlfriend
      6 german
      6 gel
      6 gallery
      6 gains
      6 futility
      6 foundation
      6 forget
      6 followed
      6 focusing
      6 florida
      6 flat
      6 flash
      6 fixes
      6 fired
      6 finish
      6 figure
      6 fights
      6 fast
      6 fans
      6 failure
      6 factory
      6 excitement
      6 exchanges
      6 examining
      6 everyone
      6 escape
      6 erwin
      6 entire
      6 english
      6 enemy
      6 ends
      6 employers
      6 edwards
      6 eaten
      6 eastern
      6 drivers
      6 dress
      6 dream
      6 drawn
      6 dozens
      6 doniger
      6 distance
      6 discusses
      6 developed
      6 designed
      6 depart
      6 defends
      6 deep
      6 decision
      6 decide
      6 debut
      6 debt
      6 daytest
      6 darrell
      6 dargis
      6 dangerous
      6 dad
      6 cyclists
      6 cycling
      6 cuban
      6 crown
      6 criminal
      6 create
      6 cotter
      6 correct
      6 coordinator
      6 cooking
      6 continues
      6 continental
      6 constitution
      6 conservatives
      6 composer
      6 component
      6 cohen
      6 clinton
      6 clinic
      6 christopher
      6 christmas
      6 childhood
      6 cera
      6 cells
      6 causing
      6 caribbean
      6 canada
      6 calcium
      6 cafe
      6 buffet
      6 budget
      6 brother
      6 brief
      6 breakfast
      6 brace
      6 boston
      6 boots
      6 bold
      6 blow
      6 blocking
      6 blockade
      6 bladder
      6 bj
      6 bias
      6 bend
      6 bell
      6 batters
      6 base
      6 banned
      6 aware
      6 auto
      6 australia
      6 aug
      6 audience
      6 attacked
      6 attached
      6 assembled
      6 arriving
      6 armed
      6 argued
      6 archives
      6 apple
      6 appeared
      6 answer
      6 animal
      6 ancient
      6 amber
      6 altering
      6 alejandro
      6 alaska
      6 alan
      6 aim
      6 aging
      6 agents
      6 adventures
      6 add
      6 accreditation
      5 zone
      5 yorkbooks
      5 wounded
      5 wound
      5 worthy
      5 worth
      5 worry
      5 worked
      5 wore
      5 wooden
      5 winerip
      5 williamsburgditch
      5 wells
      5 warned
      5 voyage
      5 vitamins
      5 vegas
      5 vary
      5 valuable
      5 valletta
      5 urinary
      5 urged
      5 updates
      5 unusual
      5 unparalleled
      5 unlike
      5 ungainly
      5 undercut
      5 ukrainian
      5 types
      5 treated
      5 travoltify
      5 tramadol
      5 trader
      5 trademark
      5 trace
      5 touristtelevision
      5 tour
      5 torture
      5 toolop
      5 titanic
      5 timespulse
      5 ties
      5 threatened
      5 thoracic
      5 therefore
      5 themthe
      5 tense
      5 tennessee
      5 tells
      5 teaching
      5 taylor
      5 talked
      5 suzanne
      5 susan
      5 surgeon
      5 surface
      5 sum
      5 sudden
      5 subtle
      5 studied
      5 strategic
      5 startrihanna
      5 starches
      5 stamping
      5 spur
      5 springs
      5 spotlighttravel
      5 splashslurp
      5 sparking
      5 southport
      5 soluble
      5 sold
      5 smear
      5 slush
      5 slaves
      5 skimmer
      5 singer
      5 significantly
      5 sides
      5 shutdown
      5 shovelfashion
      5 shaped
      5 severity
      5 sevastopol
      5 settles
      5 seems
      5 seeks
      5 sedentary
      5 secretteju
      5 secede
      5 schoolsobituaries
      5 scenic
      5 saved
      5 savages
      5 saturday
      5 sattoday
      5 sanctions
      5 russiafrank
      5 russell
      5 rule
      5 rubin
      5 roomon
      5 romanticallytheater
      5 romance
      5 roles
      5 ritual
      5 risesteeped
      5 rewriting
      5 reviewsused
      5 returns
      5 resum
      5 restriction
      5 residents
      5 residental
      5 reserve
      5 requirements
      5 republicans
      5 renegadeautomobiles
      5 released
      5 refuges
      5 refresh
      5 reform
      5 reflecting
      5 referendum
      5 reduced
      5 recruitment
      5 reasons
      5 reason
      5 realism
      5 reached
      5 rays
      5 rarely
      5 quotes
      5 quest
      5 quarter
      5 puts
      5 pulse
      5 pulposus
      5 psoriasis
      5 proving
      5 providers
      5 protesters
      5 protect
      5 prosecuting
      5 proofs
      5 promises
      5 profiles
      5 privately
      5 prisons
      5 princeton
      5 previously
      5 presidents
      5 pregnancy
      5 precautions
      5 pounds
      5 positions
      5 portions
      5 portfolios
      5 population
      5 pope
      5 pleaser
      5 playtheater
      5 playpolitics
      5 player
      5 played
      5 planned
      5 planes
      5 pitchersmovies
      5 piles
      5 philharmonicsodden
      5 personalize
      5 penchant
      5 pelvis
      5 peanuts
      5 patricia
      5 passed
      5 participants
      5 partial
      5 parents
      5 papers
      5 pancreas
      5 painu
      5 paintthe
      5 oz
      5 owen
      5 overhauleat
      5 outfront
      5 origin
      5 organization
      5 ordinary
      5 opioid
      5 operation
      5 opening
      5 onto
      5 ones
      5 oldest
      5 oh
      5 occupation
      5 obstructive
      5 nytstore
      5 nyc
      5 numerous
      5 numbing
      5 novelist
      5 noten
      5 nichesunday
      5 newsletters
      5 nbsp
      5 muscular
      5 moving
      5 moviesn
      5 mostly
      5 moose
      5 moore
      5 monster
      5 monounsaturated
      5 monkey
      5 monitor
      5 mongering
      5 monday
      5 modest
      5 models
      5 mixed
      5 missouri
      5 mission
      5 missing
      5 mid
      5 microphone
      5 metabolism
      5 mental
      5 medicarereal
      5 mayor
      5 maximum
      5 mastergeoff
      5 marines
      5 marijuana
      5 mandela
      5 maintaining
      5 mailed
      5 lucky
      5 loved
      5 lopped
      5 london
      5 lodges
      5 localdealbook
      5 liver
      5 linked
      5 ligaments
      5 lifted
      5 lift
      5 lethal
      5 lens
      5 length
      5 legumes
      5 legacy
      5 lasts
      5 largest
      5 larchmont
      5 language
      5 lamp
      5 laden
      5 kyphoplasty
      5 krugman
      5 kramer
      5 kramdens
      5 kim
      5 kevin
      5 katsuei
      5 karen
      5 jul
      5 judge
      5 journalists
      5 josh
      5 jeep
      5 jebdispatch
      5 jarred
      5 japanese
      5 jackson
      5 islanders
      5 iraq
      5 inyt
      5 invited
      5 interventions
      5 internet
      5 interactives
      5 institute
      5 instance
      5 inns
      5 inn
      5 injection
      5 informationcollectible
      5 info
      5 individuals
      5 indicted
      5 indicated
      5 indiana
      5 indian
      5 incident
      5 improvement
      5 ihsan
      5 identity
      5 identifiedthe
      5 identifiedopinion
      5 hyperlink
      5 hpmiddle
      5 hopes
      5 honey
      5 holden
      5 historywarning
      5 himsenate
      5 hillary
      5 highway
      5 herbs
      5 helping
      5 helene
      5 hearts
      5 heard
      5 healing
      5 hawaii
      5 hat
      5 harper
      5 handcrafted
      5 hammock
      5 gunshots
      5 gunfire
      5 guidance
      5 gray
      5 grapefruit
      5 gram
      5 graft
      5 goods
      5 golf
      5 golden
      5 goes
      5 goals
      5 glenn
      5 gimmicks
      5 genevat
      5 geneva
      5 gary
      5 funding
      5 fulfill
      5 fuel
      5 freeman
      5 fracture
      5 founder
      5 fought
      5 forms
      5 ford
      5 forced
      5 force
      5 fool
      5 follows
      5 fodor
      5 flushscience
      5 flies
      5 flavordealbook
      5 fixating
      5 final
      5 fernandez
      5 feed
      5 famous
      5 fallacy
      5 facility
      5 facet
      5 eyesmagazine
      5 extra
      5 exports
      5 explorer
      5 existing
      5 excessive
      5 ex
      5 evolutioneditorial
      5 establish
      5 essential
      5 equipment
      5 equal
      5 epub
      5 epidemic
      5 entrepreneurs
      5 enforcement
      5 endurance
      5 emissions
      5 emergencies
      5 emailworld
      5 elite
      5 eighth
      5 eight
      5 ego
      5 egan
      5 eating
      5 earspersonal
      5 earlier
      5 ear
      5 drop
      5 driving
      5 dried
      5 drew
      5 doorstrying
      5 doesn
      5 distribution
      5 dishes
      5 diseases
      5 discord
      5 disciplined
      5 disc
      5 disabling
      5 disability
      5 dirty
      5 direction
      5 diana
      5 dialysis
      5 detail
      5 destruction
      5 desperate
      5 depressed
      5 dependent
      5 denis
      5 delivering
      5 delay
      5 degenerative
      5 deficiency
      5 decorum
      5 december
      5 dean
      5 davis
      5 dataarts
      5 danny
      5 cyprus
      5 curtain
      5 crowded
      5 crimeans
      5 coyotes
      5 counting
      5 costume
      5 costs
      5 corn
      5 cool
      5 contained
      5 consulting
      5 conspiracy
      5 connect
      5 competition
      5 community
      5 committee
      5 cole
      5 closely
      5 clean
      5 classesde
      5 christian
      5 chemicals
      5 charter
      5 charges
      5 chandlerbooks
      5 challenge
      5 chairs
      5 ceremony
      5 cereals
      5 centers
      5 celebrations
      5 cat
      5 casino
      5 casessports
      5 cart
      5 carssell
      5 carrying
      5 carey
      5 caredining
      5 card
      5 captain
      5 campus
      5 camp
      5 calle
      5 bureau
      5 buildings
      5 bruce
      5 broke
      5 brings
      5 briefs
      5 bridge
      5 brick
      5 breathing
      5 breakfastarundhati
      5 brands
      5 bowsart
      5 bowles
      5 bowl
      5 bowel
      5 bottle
      5 boomers
      5 bookeducation
      5 bond
      5 boiled
      5 bloomberg
      5 blogs
      5 bit
      5 bin
      5 billion
      5 biennial
      5 bid
      5 behavioral
      5 beast
      5 baseline
      5 barry
      5 band
      5 ball
      5 backbusiness
      5 babystudy
      5 avenue
      5 automobilesnew
      5 austrian
      5 attorney
      5 attention
      5 assaults
      5 armory
      5 architecture
      5 arch
